# PyMySQL - Sakila Database

In [84]:
import mysql.connector
import pandas as pd

In [51]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '',
    database = 'sakila'
)

In [52]:
mycursor = mydb.cursor()

In [53]:
def sql_df(query):
    mycursor.execute(query)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult, columns=mycursor.column_names)
    return df

In [18]:
sql_df(
'''
show tables
'''
)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

### Soal 1

In [54]:
#10 film komedy dengan durasi tersingkat
sql_df(
'''
select title, category, length from film_list
where category = "Comedy"
order by length
limit 10;
'''
)

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4         ZORRO ARK   Comedy      50
5        LION UNCUT   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

### Soal 2

In [55]:
#daftar film beserta jumlah film tiap kategori & rata2 harga sewa DVD film tiap katogri
sql_df(
'''
select category as kategori, count(FID) as jumlahMovie, avg(price) as rataHargaSewa
from film_list
group by kategori
order by jumlahMovie desc;
'''
    
)

       kategori  jumlahMovie rataHargaSewa
0       Foreign           73      3.099589
1        Sports           73      3.099589
2        Family           69      2.758116
3   Documentary           68      2.666471
4     Animation           66      2.808182
5        Action           64      2.646250
6           New           63      3.116984
7        Sci-Fi           61      3.219508
8         Drama           61      2.990000
9         Games           61      3.252295
10     Children           60      2.890000
11       Comedy           58      3.162414
12     Classics           57      2.744386
13       Horror           56      3.025714
14       Travel           56      3.275714
15        Music           51      2.950784

### Soal 3

In [76]:
#10 aktor/aktris yang paling banyak membintangi film
sql_df(
'''
select a.actor_id, a.first_name, a.last_name, count(f.film_id) as jumlah_Movie
from actor_info a, film_actor f
where a.actor_id = f.actor_id
group by a.actor_id, a.first_name, a.last_name
order by jumlah_Movie desc, actor_id desc
limit 10;
'''
    
)

   actor_id first_name    last_name  jumlah_Movie
0       107       GINA    DEGENERES            42
1       102     WALTER         TORN            41
2       198       MARY       KEITEL            40
3       181    MATTHEW       CARREY            39
4        23     SANDRA       KILMER            37
5        81   SCARLETT        DAMON            36
6       158     VIVIEN     BASINGER            35
7       144     ANGELA  WITHERSPOON            35
8       106    GROUCHO        DUNST            35
9        60      HENRY        BERRY            35

### Soal 4

In [79]:
#tampilkan jumlah film by category yang dibintangi Gina Degeneres (actor_id = 107 berdasarkan output soal 3)
sql_df(
'''
select l.category, count(l.FID) as jumlah_Movie
from film_list l, film_actor a
where l.FID = a.film_id and a.actor_id = 107
group by l.category;
'''
    
)

       category  jumlah_Movie
0   Documentary             3
1       Foreign             2
2         Music             4
3           New             1
4        Sci-Fi             7
5        Action             3
6         Drama             2
7     Animation             4
8        Horror             1
9        Family             4
10       Comedy             3
11     Children             2
12     Classics             2
13       Sports             2
14        Games             1
15       Travel             1

### Soal 5

In [83]:
#daftar judul film scifi yang pernah dibintangi oleh Gina Degeneres
sql_df(
'''
select t.title, l.category
from film_actor a inner join film_list l on a.film_id = l.FID
inner join film_text t on l.FID = t.film_id
where a.actor_id = 107 and l.category = "Sci-Fi";
'''
    
)

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi